<template>
    <div class="title">
        <span class="span">
            拉时间段卡拉胶打卡打卡打卡了反垃圾打卡机拉时间段卡拉胶打卡打卡打卡了反垃圾打卡机拉时间段卡拉胶打卡打卡打卡了反垃圾打卡机拉时间段卡拉胶打卡打卡打卡了反垃圾打卡机拉时间段卡拉胶打卡打卡打卡了反垃圾打卡机拉时间段卡拉胶打卡打卡打卡了反垃圾打卡机拉时间段卡拉胶打卡打卡打卡了反垃圾打卡机拉时间段卡拉胶打卡打卡打卡了反垃圾打卡机拉时间段卡拉胶打卡打卡打卡了反垃圾打卡机拉时间段卡拉胶打卡打卡打卡了反垃圾打卡机拉时间段卡拉胶打卡打卡打卡了反垃圾打卡机拉时间段卡拉胶打卡打卡打卡了反垃圾打卡机拉时间段卡拉胶打卡打卡打卡了反垃圾打卡机拉时间段卡拉胶打卡打卡打卡了反垃圾打卡机拉时间段卡拉胶打卡打卡打卡了反垃圾打卡机拉时间段卡拉胶打卡打卡打卡了反垃圾打卡机拉时间段卡拉胶打卡打卡打卡了反垃圾打卡机拉时间段卡拉胶打卡打卡打卡了反垃圾打卡机拉时间段卡拉胶打卡打卡打卡了反垃圾打卡机拉时间段卡拉胶打卡打卡打卡了反垃圾打卡机拉时间段卡拉胶打卡打卡打卡了反垃圾打卡机拉时间段卡拉胶打卡打卡打卡了反垃圾打卡机拉时间段卡拉胶打卡打卡打卡了反垃圾打卡机拉时间段卡拉胶打卡打卡打卡了反垃圾打卡机拉时间段卡拉胶打卡打卡打卡了反垃圾打卡机
        </span>
    </div>
</template>
<style>
.title {
    line-height: 2;
}

.span {
    background: linear-gradient(to right, #000000, #000000) no-repeat right bottom;
    background-size: 0 2px;
    transition: background-size 1s ease-in-out;
}
.span:hover{
    background-position: left bottom;
    background-size: 100% 2px;
}
</style>